In [ ]:
import sqlite3
 
# Create and populate the bloodbank database
conn_bloodbank = sqlite3.connect("bloodbank.db")
cursor = conn_bloodbank.cursor()
 
# Create the tables
sql_file = open("blood_bank.sql")
sql_bloodbank = sql_file.read()
cursor.executescript(sql_bloodbank)
 
# Populate the data
sql_file = open("blood_bank_data.sql")
sql_bloodbank_data = sql_file.read()
cursor.executescript(sql_bloodbank_data)

In [ ]:
import pandas as pd

In [ ]:
d1 = '''
SELECT * 
FROM   donor
'''
table = pd.read_sql_query(d1, conn_bloodbank)
table

  Donor_id      donor_name         DOB  age  Gender  Donor_ph_no
0       D1  Royston Dmello  26-01-2000   21    MALE   7236812648
1       D2    Nishank Dave  27-02-2000   21    MALE   8936938648
2       D3     Manan Dodia  20-02-2000   21    MALE   2829982373
3       D4   Julia Roberts  20-03-1999   22  FEMALE   6323982373
4       D5    Divya Ghorui  26-06-2000   20  FEMALE    982982373
5       D6    Akshay Kumar  12-12-1995   25    MALE   5873982373
6       D7  Royston Dmello  26-01-2000   21    MALE   7236812648
7       D8      Katy Perry  16-10-1993   27  FEMALE   2873982373
8       D9    Akshay Kumar  12-12-1995   25    MALE   9873982373
9      D10  Harpreet Singh  24-04-1990   30    MALE   7673982373

In [ ]:
d2 = '''
SELECT * 
FROM   employee
'''
table = pd.read_sql_query(d2, conn_bloodbank)
table

  Emp_id        Emp_name        Emp_type Supervisor_id      Emp_ph
0     E1    Ankit Rathod  Storage Worker            E1  9856321456
1     E2        Neel Das    Receptionist            E2  9878214578
2     E3    Neelam Joshi           Nurse            E5  9832451677
3     E4     Tanmay Khan      Accountant            E7  9300225599
4     E5   Megan Anthony           Nurse            E5  9232317281
5     E6       Ram Singh  Storage Worker            E1  7895246351
6     E7     Priya Gover      Accountant            E7  8800597621
7     E8     Rashi Patil    Receptionist            E2  6589123753
8     E9  Narendra Gupta  Storage Worker            E1  6958472315
9    E10       Yash Bane           Nurse            E5  9865324544

In [ ]:
d3 = '''
SELECT * 
FROM   patient
'''
table = pd.read_sql_query(d3, conn_bloodbank)
table

  patient_id emp_id    patient_name  Age Hospital_id  Patient_ph_no
0         P1     E3   Gunjan Saxena   65          H1     3278328371
1         P2     E5  Minakshi Singh   45          H2    18927328371
2         P3     E3   Gunjan Saxena   65          H1     3278328371
3         P4     E5    Pratap Singh   16          H3     2388328371
4         P5    E10     Jinal Mehta   50          H3    21797328371
5         P6     E3      Amit Patel   36          H1     3278339872
6         P7    E10     Kaal Rathod   60          H4     2183761283
7         P8     E3     Naseer Shah   75          H2     3987329923
8         P9    E10     Jinal Mehta   50          H3    21797328371
9        P10     E5    Varun Dhawan   30          H1     8922830921

In [ ]:
d4 = '''
SELECT * 
FROM   blood
'''
table = pd.read_sql_query(d4, conn_bloodbank)
table

   Blood_id Blood_Group Donor_id patient_id emp_id
0         1          A+       D6         P2     E3
1         2          A+       D4         P8     E5
2         3          B-       D2         P5     E5
3         4          A+       D9         P4    E10
4         5          A+       D3         P6     E3
5         6          O+       D1         P1    E10
6         7         AB+      D10         P7     E3
7         8          B+       D8         P9     E5
8         9          A-       D5       NULL     E6
9        10          O+       D7         P3     E3

In [ ]:
d5 = '''
SELECT * 
FROM   collects_from
'''
table = pd.read_sql_query(d5, conn_bloodbank)
table

  Emp_id Donor_id
0     E3       D6
1     E3       D5
2    E10       D4
3     E3      D10
4     E5       D9
5     E5       D7
6     E3       D1
7     E5       D3
8    E10       D8
9     E1       D2

Q1. Display the number of patients whose age is greater than equal to 60.

In [ ]:
q1 = '''
SELECT * 
FROM   patient
where age >= 60
'''
table = pd.read_sql_query(q1, conn_bloodbank)
table

  patient_id emp_id   patient_name  Age Hospital_id  Patient_ph_no
0         P1     E3  Gunjan Saxena   65          H1     3278328371
1         P3     E3  Gunjan Saxena   65          H1     3278328371
2         P7    E10    Kaal Rathod   60          H4     2183761283
3         P8     E3    Naseer Shah   75          H2     3987329923

Q2. Display hospital id where patients are admitted.

In [ ]:
q2 = '''
SELECT patient_name, hospital_id
FROM   patient
'''
table = pd.read_sql_query(q2, conn_bloodbank)
table

     patient_name Hospital_id
0   Gunjan Saxena          H1
1  Minakshi Singh          H2
2   Gunjan Saxena          H1
3    Pratap Singh          H3
4     Jinal Mehta          H3
5      Amit Patel          H1
6     Kaal Rathod          H4
7     Naseer Shah          H2
8     Jinal Mehta          H3
9    Varun Dhawan          H1

Q3. Display the patient name who all have received blood packets and how many each.

In [ ]:
q3 = '''
SELECT patient_name
FROM  patient as P,blood as B, Donor as D
where D.donor_id = B.donor_id
and P.patient_id = B.patient_id
'''
table = pd.read_sql_query(q3, conn_bloodbank)
table

     patient_name
0  Minakshi Singh
1     Naseer Shah
2     Jinal Mehta
3    Pratap Singh
4      Amit Patel
5   Gunjan Saxena
6     Kaal Rathod
7     Jinal Mehta
8   Gunjan Saxena

Q4. How many packets of blood are available in storage?

In [ ]:
q4='''
SELECT *
FROM blood
WHERE patient_id="NULL"
'''
table = pd.read_sql_query(q4, conn_bloodbank)
table

   Blood_id Blood_Group Donor_id patient_id emp_id
0         9          A-       D5       NULL     E6

Q5. Display the name of the donor who has donated blood more than once

In [ ]:
q5='''
SELECT count(donor_name),donor_name
FROM donor
group by donor_name
having count(donor_name)>1
'''
table = pd.read_sql_query(q5, conn_bloodbank)
table

   count(donor_name)      donor_name
0                  2    Akshay Kumar
1                  2  Royston Dmello

Q6. Display the names of the nurses working in the blood bank.

In [ ]:
q6='''
SELECT emp_id, emp_name, emp_type, emp_ph
FROM employee
WHERE emp_type LIKE 'Nur%'
'''
table = pd.read_sql_query(q6, conn_bloodbank)
table

  Emp_id       Emp_name Emp_type      Emp_ph
0     E3   Neelam Joshi    Nurse  9832451677
1     E5  Megan Anthony    Nurse  9232317281
2    E10      Yash Bane    Nurse  9865324544

Q7. Display the name's of the patient who have received A+ blood.

In [ ]:
q7 = '''
SELECT b.blood_group, b.patient_id, p.patient_name
FROM blood as b , patient as p
WHERE b.blood_group = "A+"
AND b.patient_id = p.patient_id
'''
table = pd.read_sql_query(q7, conn_bloodbank)
table

  Blood_Group patient_id    patient_name
0          A+         P2  Minakshi Singh
1          A+         P8     Naseer Shah
2          A+         P4    Pratap Singh
3          A+         P6      Amit Patel

Q8. Update the donor table wherein the phone number

 of "Royston Dmello" has changed.

In [ ]:
 # Create a copy of donor table
new_table_query = ''' 
create table donor_3 as select * from donor
'''
conn_bloodbank.execute(new_table_query)

In [ ]:
update_q8 = '''
update donor_3
set donor_ph_no = 9832005533
where donor_name = "Royston Dmello"
'''
conn_bloodbank.execute(update_q8)

In [ ]:
# Updated donor_3 table
q9 = '''
select *
from donor_3
'''
table_donor_3 = pd.read_sql_query(q9, conn_bloodbank)
table_donor_3

  Donor_id      donor_name         DOB  age  Gender  Donor_ph_no
0       D1  Royston Dmello  26-01-2000   21    MALE   9832005533
1       D2    Nishank Dave  27-02-2000   21    MALE   8936938648
2       D3     Manan Dodia  20-02-2000   21    MALE   2829982373
3       D4   Julia Roberts  20-03-1999   22  FEMALE   6323982373
4       D5    Divya Ghorui  26-06-2000   20  FEMALE    982982373
5       D6    Akshay Kumar  12-12-1995   25    MALE   5873982373
6       D7  Royston Dmello  26-01-2000   21    MALE   9832005533
7       D8      Katy Perry  16-10-1993   27  FEMALE   2873982373
8       D9    Akshay Kumar  12-12-1995   25    MALE   9873982373
9      D10  Harpreet Singh  24-04-1990   30    MALE   7673982373

In [ ]:
# Show the tables before dropping
cursor.execute(" SELECT name FROM sqlite_master WHERE type='table' ")
print(cursor.fetchall())

q9a = '''
DROP TABLE donor_3
'''
cursor.execute(q9a) 

# Show the tables after dropping
cursor.execute(" SELECT name FROM sqlite_master WHERE type='table' ")
print(cursor.fetchall())

[('Donor',), ('Employee',), ('Patient',), ('Blood',), ('Collects_From',), ('donor_3',)]
[('Donor',), ('Employee',), ('Patient',), ('Blood',), ('Collects_From',)]

Q9. Display the hospital id where Akshay Kumars blood packets were delivered to

In [ ]:
q10 = '''
SELECT p.hospital_id
FROM donor as d , blood as b , patient as p
WHERE d.donor_name="Akshay Kumar"
AND d.donor_id = b.donor_id
AND b.patient_id=p.patient_id
'''
table = pd.read_sql_query(q10, conn_bloodbank)
table

  Hospital_id
0          H2
1          H3

Q10. Calculate the average age of the donors

In [ ]:
q7 = '''
SELECT avg(age) as average_age
FROM   Donor
'''
table = pd.read_sql_query(q7, conn_bloodbank)
table

   average_age
0         23.3

Q11. Display the employee ID, donor name and age. Donors age should be in descending order.

In [ ]:
q8 = '''
SELECT   C.emp_id, D.donor_name, D.age
FROM     collects_from as C, Donor as D
WHERE    C.donor_id = D.donor_id
ORDER BY D.age DESC
'''
table = pd.read_sql_query(q8, conn_bloodbank)
table

  Emp_id      donor_name  age
0     E3  Harpreet Singh   30
1    E10      Katy Perry   27
2     E3    Akshay Kumar   25
3     E5    Akshay Kumar   25
4    E10   Julia Roberts   22
5     E5  Royston Dmello   21
6     E3  Royston Dmello   21
7     E5     Manan Dodia   21
8     E1    Nishank Dave   21
9     E3    Divya Ghorui   20

Q12. Find those employees who have collected blood from donors. 

Display the donor names in ascending order

In [ ]:
q9 = '''
SELECT E.emp_id, B.donor_id, D.donor_name
FROM   Employee as E NATURAL INNER JOIN Blood as b NATURAL INNER JOIN Donor As D
ORDER BY D.donor_name
'''
table = pd.read_sql_query(q9, conn_bloodbank)
table

  Emp_id Donor_id      donor_name
0     E3       D6    Akshay Kumar
1    E10       D9    Akshay Kumar
2     E6       D5    Divya Ghorui
3     E3      D10  Harpreet Singh
4     E5       D4   Julia Roberts
5     E5       D8      Katy Perry
6     E3       D3     Manan Dodia
7     E5       D2    Nishank Dave
8    E10       D1  Royston Dmello
9     E3       D7  Royston Dmello

Q13. Display employee ID who has done tasks like collecting blood from the donor and delivering blood to a patient.

In [ ]:
q10 = '''
  SELECT emp_id
  FROM   blood as B
INTERSECT
  SELECT emp_id
  FROM   patient as P
'''
table = pd.read_sql_query(q10, conn_bloodbank)
table

  emp_id
0    E10
1     E3
2     E5